---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalLinkReleaseTranslationX
source: html/bb802838-c243-3ff2-65db-aa5070d348de.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalLinkReleaseTranslationX Property

"X Translation"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalLinkReleaseTranslationX { get; }
```